In [1]:
import pandas as pd

In [7]:
my_dict={'names':['ram','shyam','hari'], 'age':['25','35','40']}

In [8]:
df=pd.DataFrame(my_dict)

In [9]:
df

   names age
0    ram  25
1  shyam  35
2   hari  40

In [10]:
df.age=32

In [11]:
df

   names  age
0    ram   32
1  shyam   32
2   hari   32

In [12]:
df['age']=[50,60,70]

In [13]:
df

   names  age
0    ram   50
1  shyam   60
2   hari   70

In [14]:
df['age']=[50,60,70,80]

ValueError: Length of values (4) does not match length of index (3)

In [ ]:
df

In [15]:
df['addr']='Ktm'

In [16]:
df

   names  age addr
0    ram   50  Ktm
1  shyam   60  Ktm
2   hari   70  Ktm

In [17]:
df['addr']=['Kathamandu','Pokhara','Bhaktapur']

In [18]:
df

   names  age        addr
0    ram   50  Kathamandu
1  shyam   60     Pokhara
2   hari   70   Bhaktapur

In [19]:
df['dist']=['ktm','pokhara','bhaktapur']

In [20]:
df

   names  age        addr       dist
0    ram   50  Kathamandu        ktm
1  shyam   60     Pokhara    pokhara
2   hari   70   Bhaktapur  bhaktapur

In [21]:
df['age']=['28','30','35']

In [22]:
df

   names age        addr       dist
0    ram  28  Kathamandu        ktm
1  shyam  30     Pokhara    pokhara
2   hari  35   Bhaktapur  bhaktapur

In [23]:
df.age.astype('int')

0    28
1    30
2    35
Name: age, dtype: int32

In [24]:
df.dtypes

names    object
age      object
addr     object
dist     object
dtype: object

In [25]:
df.age=df.age.astype('int')

In [26]:
df.dtypes

names    object
age       int32
addr     object
dist     object
dtype: object

In [27]:
pd.read_csv('titanic.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
df=pd.read_csv('titanic.csv')

In [29]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [30]:
df.iloc[50]

PassengerId                            51
Survived                                0
Pclass                                  3
Name           Panula, Master. Juha Niilo
Sex                                  male
Age                                   7.0
SibSp                                   4
Parch                                   1
Ticket                            3101295
Fare                              39.6875
Cabin                                 NaN
Embarked                                S
Name: 50, dtype: object

In [31]:
df.iloc[[50]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S

In [32]:
df.iloc[[3,10,100]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S

In [33]:
df.iloc[1:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [34]:
df.iloc[1:10:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [36]:
df.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [37]:
df.Age.isnull().sum()

177

In [38]:
df.Cabin.isnull().sum()

687

In [40]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [41]:
df.Age.agg(['min','max','mean'])

min      0.420000
max     80.000000
mean    29.699118
Name: Age, dtype: float64

In [43]:
df.agg({'Age':['min','max'],'Fare':['mean','median']})

          Age       Fare
min      0.42        NaN
max     80.00        NaN
mean      NaN  32.204208
median    NaN  14.454200